public class Main {
  public static void main(String[] args) {
//  Сегодня возраст нашего героя - 50 лет, сколько лет ему было в 2007?










/*
  Создайте класс Task с полями:
  - title
  - description
  - status
  - date - LocalDate
  С методами:
  - switchStatus
  - changeTitle(String title)

  Пусть заявка создается со статусом не выполнено.
  Создайте лист задач. Пусть хотя бы одна будет на эту субботу.
  Дополнительно:
  - Поменяйте название на прописные буквы для тех задач,
  которые будут в течение 10 дней с настоящего момента.
  - Поменяйте статус у задач, которые назначены на субботу.
  - Напишите метод procrastinate - который откладывает задачу на один день.
  - Отложите все задачи листа на один день.

 */


  }
}